Autodesk.Revit.DB.Lighting.AdvancedLossFactor.VoltageLossFactor
The voltage loss factor.
The loss factor as a numerical value between 0.0 and 2.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The loss factor is not valid because it is not between 0.0 and 2.0.
Since:
2013

Autodesk.Revit.DB.Lighting.AdvancedLossFactor.TemperatureLossFactor
The temperature loss factor.
The loss factor as a numerical value between 0.0 and 2.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The loss factor is not valid because it is not between 0.0 and 2.0.
Since:
2013

Autodesk.Revit.DB.Lighting.AdvancedLossFactor.SurfaceDepreciationLossFactor
The surface depreciation loss factor.
The loss factor as a numerical value between 0.0 and 1.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The loss factor is not valid because it is not between 0.0 and 1.0.
Since:
2013

Autodesk.Revit.DB.Lighting.AdvancedLossFactor.LuminaireDirtDepreciation
The luminaire dirt depreciation loss factor.
The loss factor as a numerical value between 0.0 and 1.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The loss factor is not valid because it is not between 0.0 and 1.0.
Since:
2013

Autodesk.Revit.DB.Lighting.AdvancedLossFactor.LampTiltLossFactor
The lamp tilt loss factor.
The loss factor as a numerical value between 0.0 and 1.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The loss factor is not valid because it is not between 0.0 and 1.0.
Since:
2013

Autodesk.Revit.DB.Lighting.AdvancedLossFactor.LampLumenDepreciation
The lamp lumen depreciation loss factor.
The loss factor as a numerical value between 0.0 and 1.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The loss factor is not valid because it is not between 0.0 and 1.0.
Since:
2013

Autodesk.Revit.DB.Lighting.AdvancedLossFactor.BallastLossFactor
The ballast loss factor.
The loss factor as a numerical value between 0.0 and 1.0
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The loss factor is not valid because it is not between 0.0 and 1.0.
Since:
2013

Autodesk.Revit.DB.Lighting.AdvancedLossFactor.#ctor(Autodesk.Revit.DB.Lighting.AdvancedLossFactor)
Creates a copy of the given advanced loss factor object
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.AdvancedLossFactor.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Creates an advanced loss factor object with the given values.
ballastLossFactorIn:
The ballast loss factor as a numerical value between 0.0 and 1.0.
lampLumenDepreciationIn:
The lamp lumen depreciation loss factor as a numerical value between 0.0 and 1.0.
lampTiltLossFactorIn:
The lamp tilt loss factor as a numerical value between 0.0 and 1.0.
luminaireDirtDepreciationIn:
The luminaire dirt depreciation loss factor as a numerical value between 0.0 and 1.0.
surfaceDepreciationLossFactorIn:
The surface depreciation loss factor as a numerical value between 0.0 and 1.0.
temperatureLossFactorIn:
The temperature loss factor as a numerical value between 0.0 and 2.0.
voltageLossFactorIn:
The voltage loss factor as a numerical value between 0.0 and 2.0.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The loss factor is not valid because it is not between 0.0 and 1.0.
-or-
The loss factor is not valid because it is not between 0.0 and 2.0.
Since:
2013

Autodesk.Revit.DB.Lighting.AdvancedLossFactor.#ctor
Creates an advanced loss factor object with values set to no loss.
Since:
2013

Autodesk.Revit.DB.Lighting.AdvancedLossFactor
This class encapsulates advanced lighting loss factor calculation.
Remarks:
Advanced lighting loss factor is a combination of several different factors.
Each factor has a value of 0.0 (total loss) to 1.0 (no loss).
Since:
2013